package com.kozak.triangles.data;

import java.util.HashMap;
import java.util.Map;
import java.util.TreeSet;

public class PredictionsTableData {

    @SuppressWarnings({ "unchecked", "rawtypes", "serial" })
    private static Map<Integer, String> predictions = new HashMap() {
        {
            put(1, "Всегда тестируй то, что ты сделал.");
            put(2, "Не каждой осенью листья желтеют...");
            put(3, "Кошки агрессивней, когда не кастрированы. Коты, так вообще, хуже натравленых собак.");
            put(4, "Добро и зло понятия относительные. Никогда не знаешь, к чему приведут твои действия.");
            put(6, "Вопрос: 'А что подумают люди?' должен стоять на последнем месте. По сути всем всё равно, а жизнь то твоя.");
            put(7, "Уметь слушать чужие мысли не так уж и круто. В основном это 'когда же я высплюсь?' и 'так хочется жрать'.");
            put(8, "Было бы круто, если бы платили за то, что у тебя нет денег.");
            put(9, "И на небе мост унесло! <br/> Две звезды, рекою разлучены, <br/> Одиноко на скалах спят.");
            put(10, "Филологи и математики очень похожи. Все они работают официантами.");
            put(11, "Если хочешь идти быстро - иди один. Если хочешь идти далеко - идите вместе.");
            put(12, "Когда тебе говорят 'будь собой', правда ведь, что ты теряешься и не знаень, кем из собой тебе быть?");
            put(13, "Проводи каждый день своей жизни, как будто он у тебя последний: лежи на кровати, кашляй, собери родственников, обоссысь.");
            put(14, "Тот, кто сказал: 'Неважно, выиграл ты или проиграл', скорее всего проиграл.");
            put(15, "Минуты длительны, а годы быстротечны.");
            put(16, "Что быстрее проходит, год или минута?");
            put(17, "Сделал дело - гуляй смело. Дело не сделал - гуляй бойся!");
            put(18, "Если решить проблемы, на смену им придут новые. Старые роднее, поэтому оставь все, как есть. Ты же консерватор, а не ленивая жопа!");
            put(19, "Цените людей! Особенно тех, у кого ваша группа крови.");
            put(20, "Нынче выпал ясный день, <br/> Но откуда брызжут капли? <br/> В небе облака клочок...");
            put(21, "Идут тяжелые снега - <br/> Словно одним дыханием соединены <br/> Земля и небеса...");
            put(22, "Прошлой весной <br/> Лепестки облетели, но видишь <br/> Вишни снова в цвету. Ах, когда б и наша разлука <br/> Оказалась цветам сродни!");
            put(23, "Если тебе кажется, что ты ничего из себя не представляешь и ты никому не нужен - тебе не кажется.");
            put(24, "Зачем тебе нужна половинка? Чтобы тебя было полтора?");
            put(25, "Если тебе грустно из-за того, что ты будешь одинок в день влюбленных, просто вспомни - в остальные дни тебя тоже никто не любит.");
            put(26, "Круто бы вернуться во времена сталинских репрессий, реформ и смертных казней. Говорят, тогда пломбир очень вкусный был.");
            put(27, "Не оплакивай упущенный шанс. Он не последний. В твоей жизни еще будет очень много упущенных шансов.");
            put(28, "Жизнь не настолько сложна. Встаешь, идешь на работу, ешь три раза в день, один раз хорошенько срешь и назад в постель. Не усложняйте!");
            put(29, "Всё недоступное кажется сладким, но после объедания замечаешь, что оно, как заплесневелый хлеб.");
            put(30, "Когда тебе суют флаер на улице, представь, будто ты смотришь в окно. Это как со старушками в автобусе.");
            put(31, "Пока ты семь раз отмеришь, другие уже отрежут.");
            put(32, "Истинное богатство - это наши способности! Они внутри, а снаружи только их проявление.");
            put(33, "Если ты хочешь что-то сделать, но не решаешься, ждешь =знака свыше= - то это вот он. Иди и делай! Все получится!");
            put(34, "в холодном воздухе осеннем <br/> звук словно движется быстрей <br/> сперва ушей достигнет эхо <br/> потом коснется лба свинец");
            put(35, "83% всех дней в году начинаются одинаково: звенит будильник.");
            put(36, "Все правильно: деньги нужны человеку для того, чтобы никогда о них не думать.");
            put(37, "Просто удивительно, как быстро проходят волны восторга. Грызть себя, уязвлять себя, нудить и зудеть можно часами и сутками, а восторг приходит и тут же уходит.");
            put(38, "А какой смысл покупать машину, чтобы разъезжать по асфальту?Там, где асфальт, ничего интересного, а где интересно, там нет асфальта.");
            put(39, "Фантазия — бесценная вещь, но нельзя ей давать дорогу внутрь. ");
            put(40, "Скептицизм и цинизм в жизни стоят дешево, потому что это много легче и скучнее, нежели удивляться и радоваться жизни.");
            put(41, "Среди них никто точно не знал, что такое счастье и в чем именно смысл жизни. И они приняли рабочую гипотезу, что счастье — в непрерывном познании неизвестного, и смысл жизни в том же.");
            put(42, "Не в громе космической катастрофы, не в пламени атомной войны и даже не в тисках перенаселения, а в сытой, спокойной тишине кончается история человечества.");
            put(43, "Нужно знать роль каждой строки своей программы.");
            put(44, "Сделать сложно - просто. Сделать просто - сложно.");
            put(45, "Иногда один способ работает лучше, иногда - другой. Но прежде, чем выбрать какой-то один, надо рассмотреть оба.");
            put(46, "Если это не трудно, значит за это не стоит браться.");
            put(47, "Всё, чем стоит заниматься, изначально будет неприятным.");
            put(48, "Всё, чем стоит заниматься, должно идти через боль и жертвы.");
            put(49, "Эта боль является вызовом со стороны сознания – научитесь ли вы фокусироваться и преодолеете скуку, или, будто ребёнок, поддадитесь необходимости немедленно получить удовольствие и отвлечение?");
            put(50, "Делайте что-либо и не останавливайтесь, пока не закончите, НЕВАЖНО, сколько времени это займёт.");
            put(51, "Ты не не нетупой.");
            put(52, "Не спеши, но и не опаздывай.");
            put(53, "Всему свое время.");
            put(54, "Будь методичным, монотонным и настойчивым.");
            put(55, "Хочешь или нужно?");
            put(56, "Не уходи от неизбежного и не меняй неизменяемое.");
            put(57, "Завтра будет завтра.");
            put(58, "Живи сегодняшним днем.");
            put(59, "Торопись медленно.");
            put(60, "У мужиков не бывает депрессии, у мужиков может быть только пофигизм.");
            put(61, "Не забивай и не останавливайся!");
        }
    };

    /**
     * @return все ID предсказаний, отсортированные в порядке (1, 2, 3, ...)
     */
    public static TreeSet<Integer> getPredictionsIds() {
        return new TreeSet<Integer>(predictions.keySet());
    }

    /**
     * @return предсказание по его ID
     */
    public static String getPrediction(int id) {
        return predictions.get(id);
    }
}
